# IFC_CreateZSG

## Description
Creates Zone, System or Group based on the selector passed.

```pascal
FUNCTION IFC_CreateZSG(
				selector : INTEGER;
				ZSGName  : STRING): BOOLEAN;
```

```python
def vs.IFC_CreateZSG(selector, ZSGName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|selector|INTEGER|   |
|ZSGName|STRING|   |

## Version
Availability: from Vectorworks 2022.1

## Category
* IFC